tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleWaterStartApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint16_t r1Min = 0;
    uint16_t r2Min = 0;
    bool useR1 = true;
    bool useR2 = false;
    SettingsStore::ExecutionMode mode = SettingsStore::defaultExecutionMode();
    (void)readUIntParam("r1_min", &r1Min);
    (void)readUIntParam("r2_min", &r2Min);
    (void)readBoolParam("r1_enabled", &useR1);
    (void)readBoolParam("r2_enabled", &useR2);
    if (Esp32BaseWeb::hasParam("mode") && !readModeParam("mode", &mode)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_mode\"}");
        return;
    }
    const uint16_t r1Sec = useR1 ? minutesToSeconds(r1Min) : 0;
    const uint16_t r2Sec = useR2 ? minutesToSeconds(r2Min) : 0;
    if (!WateringSession::startManual(r1Sec, r2Sec, mode, RecordStore::SOURCE_WEB, "web manual")) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_watering_request\"}");
        return;
    }
    redirectTo("/irrigation/manual");
}

void handleWaterStopApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint16_t road = 0;
    (void)readUIntParam("road", &road);
    if (road == 0) {
        WateringSession::stopAll(WateringSession::REASON_MANUAL_STOP, "web stop all");
    } else if (road <= 2) {
        WateringSession::stopRoad(static_cast<uint8_t>(road), WateringSession::REASON_MANUAL_STOP, "web stop road");
    } else {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_road\"}");
        return;
    }
    redirectTo("/irrigation/manual");
}

void handleAlertsClearApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    LeakMonitor::clearAlerts();
    redirectTo("/irrigation");
}

void handlePlansApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        beginJson();
        Esp32BaseWeb::sendChunk("{\"count\":");
        writeUInt(PlanStore::MaxPlans);
        Esp32BaseWeb::sendChunk(",\"plans\":[");
        for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
            if (i) Esp32BaseWeb::sendChunk(",");
            writePlanJson(i, PlanStore::get(i));
        }
        Esp32BaseWeb::sendChunk("]}");
        endJson();
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("GET,POST");
        return;
    }
    uint16_t indexRaw = 0;
    if (!readUIntParam("index", &indexRaw) || indexRaw >= PlanStore::MaxPlans) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_index\"}");
        return;
    }
    PlanStore::Plan plan = PlanStore::get(static_cast<uint8_t>(indexRaw));
    bool enabled = false;
    uint16_t value = 0;
    char text[12] = "";
    if (readBoolParam("enabled", &enabled)) plan.enabled = enabled;
    if (Esp32BaseWeb::getParam("time", text, sizeof(text)) && strlen(text) >= 5) {
        plan.minuteOfDay = static_cast<uint16_t>(atoi(text) * 60 + atoi(text + 3));
    }
    if (readUIntParam("r1_min", &value)) plan.roadSec[0] = minutesToSeconds(value);
    if (readUIntParam("r2_min", &value)) plan.roadSec[1] = minutesToSeconds(value);
    bool useRoad = false;
    if (readBoolParam("r1_enabled", &useRoad) && !useRoad) plan.roadSec[0] = 0;
    if (readBoolParam("r2_enabled", &useRoad) && !useRoad) plan.roadSec[1] = 0;
    SettingsStore::ExecutionMode mode = plan.mode;
    if (Esp32BaseWeb::hasParam("mode") && readModeParam("mode", &mode)) plan.mode = mode;
    if (readUIntParam("cycle_days", &value) && value >= 1 && value <= 30) plan.cycleDays = static_cast<uint8_t>(value);
    uint32_t ymd = 0;
    if (readU32Param("cycle_start_ymd", &ymd)) plan.cycleStartYmd = ymd;
    plan.cycleMask = readCycleMaskFromForm(plan.cycleDays);
    if (!PlanStore::set(static_cast<uint8_t>(indexRaw), plan)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_plan\"}");
        return;
    }
    (void)EventStore::append(EventStore::TYPE_PLAN_CHANGED, EventStore::SOURCE_WEB, 0, 0, indexRaw, plan.cycleDays, "plan saved");
    redirectTo("/irrigation/plan-config");
}

void handlePlanSkipApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    char action[16] = "";
    uint32_t ymd = 0;
    if (!Esp32BaseWeb::getParam("action", action, sizeof(action)) || !readU32Param("ymd", &ymd)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_skip_request\"}");
        return;
    }
    bool ok = true;
    if (strcmp(action, "skip_once") == 0 || strcmp(action, "clear_skip") == 0) {
        uint16_t index = 0;
        ok = readUIntParam("index", &index) && index < PlanStore::MaxPlans;
        if (ok) {
            ok = strcmp(action, "skip_once") == 0
                ? PlanSkipStore::setSkipped(static_cast<uint8_t>(index), ymd)
                : PlanSkipStore::clearSkipped(static_cast<uint8_t>(index), ymd);
        }
    } else if (strcmp(action, "skip_day") == 0) {
        char scope[12] = "all";
        (void)Esp32BaseWeb::getParam("scope", scope, sizeof(scope));
        const bool remaining = strcmp(scope, "remaining") == 0 && ymd == currentYmd();
        const uint16_t nowMinute = currentMinuteOfDay();
        for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
            const PlanStore::Plan& plan = PlanStore::get(i);
            if (!plan.enabled || !PlanStore::shouldRunOnDate(plan, ymd) || plan.lastRunYmd == ymd) continue;
            if (remaining && plan.minuteOfDay <= nowMinute) continue;
            ok = PlanSkipStore::setSkipped(i, ymd) && ok;
        }
    } else {
        ok = false;
    }
    if (!ok) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"skip_failed\"}");
        return;
    }
    (void)EventStore::append(EventStore::TYPE_PLAN_CHANGED, EventStore::SOURCE_WEB, 0, 0, static_cast<int32_t>(ymd), 0, action);
    redirectTo("/irrigation/plans");
}

void writeRecordJson(const RecordStore::Record& record, void* user) {
    bool* first = static_cast<bool*>(user);
    if (!*first) Esp32BaseWeb::sendChunk(",");
    *first = false;
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(record.id);
    Esp32BaseWeb::sendChunk(",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::sourceName(static_cast<RecordStore::Source>(record.source)));
    Esp32BaseWeb::sendChunk("\",\"mode\":\"");
    Esp32BaseWeb::writeJsonEscaped(modeName(static_cast<SettingsStore::ExecutionMode>(record.mode)));
    Esp32BaseWeb::sendChunk("\",\"stop_reason\":\"");
    Esp32BaseWeb::writeJsonEscaped(WateringSession::stopReasonName(static_cast<WateringSession::StopReason>(record.stopReason)));
    Esp32BaseWeb::sendChunk("\"}");
}

void handleRecordsApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson();
    Esp32BaseWeb::sendChunk("{\"count\":");
    writeUInt(RecordStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(RecordStore::capacity());
    Esp32BaseWeb::sendChunk(",\"records\":[");
    bool first = true;
    (void)RecordStore::readLatest(0, 20, writeRecordJson, &first);
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handleRecordsCsvApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::beginCsv(200, "irrigation-records.csv")) return;
    Esp32BaseWeb::sendChunk("session_id,source,mode,stop_reason,session_started_ms,session_ended_ms,enabled_roads,flow_no_pulse_timeout_s,road,state,target_sec,actual_sec,road_started_ms,road_ended_ms,pulse_start,pulse_end,pulses,pulse_per_liter,calibration_x1000,estimated_ml\r\n");
    auto cb = [](const RecordStore::Record& record, void*) {
        for (uint8_t road = 1; road <= 2; ++road) {
            const RecordStore::RoadRecord& rr = record.roads[road - 1];
            const uint32_t pulses = rr.endedPulseCount >= rr.startedPulseCount ? rr.endedPulseCount - rr.startedPulseCount : 0;
            const uint32_t actualSec = rr.endedMs >= rr.startedMs && rr.startedMs > 0 ? (rr.endedMs - rr.startedMs) / 1000UL : 0;
            writeUInt(record.id); Esp32BaseWeb::sendChunk(",");
            Esp32BaseWeb::writeCsvEscaped(RecordStore::sourceName(static_cast<RecordStore::Source>(record.source))); Esp32BaseWeb::sendChunk(",");
            Esp32BaseWeb::writeCsvEscaped(modeName(static_cast<SettingsStore::ExecutionMode>(record.mode))); Esp32BaseWeb::sendChunk(",");
            Esp32BaseWeb::writeCsvEscaped(WateringSession::stopReasonName(static_cast<WateringSession::StopReason>(record.stopReason))); Esp32BaseWeb::sendChunk(",");
            writeUInt(record.sessionStartedMs); Esp32BaseWeb::sendChunk(",");
            writeUInt(record.sessionEndedMs); Esp32BaseWeb::sendChunk(",");
            writeUInt(record.enabledRoads); Esp32BaseWeb::sendChunk(",");
            writeUInt(record.flowNoPulseTimeoutSec); Esp32BaseWeb::sendChunk(",");
            writeUInt(road); Esp32BaseWeb::sendChunk(",");
            Esp32BaseWeb::writeCsvEscaped(WateringSession::roadStateName(static_cast<WateringSession::RoadState>(rr.state))); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.targetSec); Esp32BaseWeb::sendChunk(",");
            writeUInt(actualSec); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.startedMs); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.endedMs); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.startedPulseCount); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.endedPulseCount); Esp32BaseWeb::sendChunk(",");
            writeUInt(pulses); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.pulsePerLiter); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.calibrationX1000); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.estimatedMilliliters); Esp32BaseWeb::sendChunk("\r\n");
        }
    };
    (void)RecordStore::readLatest(0, 50, cb, nullptr);
    Esp32BaseWeb::endResponse();
}

