tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeEventJsonCb(const EventStore::Event& event, void* user) {
    bool* first = static_cast<bool*>(user);
    if (!*first) Esp32BaseWeb::sendChunk(",");
    *first = false;
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk(",\"type\":\"");
    Esp32BaseWeb::writeJsonEscaped(EventStore::typeName(static_cast<EventStore::Type>(event.type)));
    Esp32BaseWeb::sendChunk("\",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(EventStore::sourceName(static_cast<EventStore::Source>(event.source)));
    Esp32BaseWeb::sendChunk("\",\"text\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.text);
    Esp32BaseWeb::sendChunk("\"}");
}

void handleEventsApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson();
    Esp32BaseWeb::sendChunk("{\"count\":");
    writeUInt(EventStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(EventStore::capacity());
    Esp32BaseWeb::sendChunk(",\"events\":[");
    bool first = true;
    (void)EventStore::readLatest(0, 20, writeEventJsonCb, &first);
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handleEventsCsvApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::beginCsv(200, "irrigation-events.csv")) return;
    Esp32BaseWeb::sendChunk("event_id,type,source,uptime_ms,epoch,road,code,value1,value2,text\r\n");
    auto cb = [](const EventStore::Event& event, void*) {
        writeUInt(event.id); Esp32BaseWeb::sendChunk(",");
        Esp32BaseWeb::writeCsvEscaped(EventStore::typeName(static_cast<EventStore::Type>(event.type))); Esp32BaseWeb::sendChunk(",");
        Esp32BaseWeb::writeCsvEscaped(EventStore::sourceName(static_cast<EventStore::Source>(event.source))); Esp32BaseWeb::sendChunk(",");
        writeUInt(event.uptimeMs); Esp32BaseWeb::sendChunk(",");
        writeUInt(event.epoch); Esp32BaseWeb::sendChunk(",");
        writeUInt(event.road); Esp32BaseWeb::sendChunk(",");
        writeUInt(event.code); Esp32BaseWeb::sendChunk(",");
        writeInt(event.value1); Esp32BaseWeb::sendChunk(",");
        writeInt(event.value2); Esp32BaseWeb::sendChunk(",");
        Esp32BaseWeb::writeCsvEscaped(event.text); Esp32BaseWeb::sendChunk("\r\n");
    };
    (void)EventStore::readLatest(0, 50, cb, nullptr);
    Esp32BaseWeb::endResponse();
}

}

namespace IrrigationWeb {

void begin() {
    const bool overviewOk = Esp32BaseWeb::addPage("/irrigation", "总览", handleOverviewPage);
    const bool manualOk = Esp32BaseWeb::addPage("/irrigation/manual", "手动", handleManualPage);
    const bool recentOk = Esp32BaseWeb::addPage("/irrigation/plans", "近期计划", handlePlansPage);
    const bool configPageOk = Esp32BaseWeb::addPage("/irrigation/plan-config", "计划配置", handlePlanConfigPage);
    const bool dataOk = Esp32BaseWeb::addPage("/irrigation/data", "记录", handleDataPage);
    const bool settingsOk = Esp32BaseWeb::addPage("/irrigation/settings", "设置", handleSettingsPage);
    const bool debugOk = Esp32BaseWeb::addPage("/irrigation/debug", "调试", handleDebugPage);
    const bool planEditOk = Esp32BaseWeb::addRoute("/irrigation/plan", Esp32BaseWeb::METHOD_GET, handlePlanEditPage);
    const bool statusOk = Esp32BaseWeb::addApi("/api/v1/status", handleStatusApi);
    const bool configOk = Esp32BaseWeb::addApi("/api/v1/config", handleConfigApi);
    const bool startOk = Esp32BaseWeb::addApi("/api/v1/water/start", handleWaterStartApi);
    const bool stopOk = Esp32BaseWeb::addApi("/api/v1/water/stop", handleWaterStopApi);
    const bool recordsOk = Esp32BaseWeb::addApi("/api/v1/records", handleRecordsApi);
    const bool recordsCsvOk = Esp32BaseWeb::addApi("/api/v1/records.csv", handleRecordsCsvApi);
    const bool eventsOk = Esp32BaseWeb::addApi("/api/v1/events", handleEventsApi);
    const bool eventsCsvOk = Esp32BaseWeb::addApi("/api/v1/events.csv", handleEventsCsvApi);
    const bool plansOk = Esp32BaseWeb::addApi("/api/v1/plans", handlePlansApi);
    const bool skipOk = Esp32BaseWeb::addApi("/api/v1/plans/skip", handlePlanSkipApi);
    const bool alertsOk = Esp32BaseWeb::addApi("/api/v1/alerts/clear", handleAlertsClearApi);
    ESP32BASE_LOG_I("irrigation.web", "routes overview=%s manual=%s recent=%s planConfig=%s data=%s settings=%s debug=%s planEdit=%s status=%s config=%s start=%s stop=%s records=%s recordsCsv=%s events=%s eventsCsv=%s plans=%s skip=%s alerts=%s firmware=%s",
                    overviewOk ? "ok" : "fail",
                    manualOk ? "ok" : "fail",
                    recentOk ? "ok" : "fail",
                    configPageOk ? "ok" : "fail",
                    dataOk ? "ok" : "fail",
                    settingsOk ? "ok" : "fail",
                    debugOk ? "ok" : "fail",
                    planEditOk ? "ok" : "fail",
                    statusOk ? "ok" : "fail",
                    configOk ? "ok" : "fail",
                    startOk ? "ok" : "fail",
                    stopOk ? "ok" : "fail",
                    recordsOk ? "ok" : "fail",
                    recordsCsvOk ? "ok" : "fail",
                    eventsOk ? "ok" : "fail",
                    eventsCsvOk ? "ok" : "fail",
                    plansOk ? "ok" : "fail",
                    skipOk ? "ok" : "fail",
                    alertsOk ? "ok" : "fail",
                    IrrigationVersion::FirmwareName);
}

}
